app/views/opening_hours/_list.html.erb

  <tbody>
    <% if place.opening_hours.size > 0 %>
---
SELECT COUNT(*) FROM `opening_hours`  WHERE `opening_hours`.`place_id` = 1
SELECT `opening_hours`.* FROM `opening_hours`  WHERE `opening_hours`.`place_id` = 1