app/views/opening_hours/_shift.html.erb

SELECT COUNT(*) FROM `shifts`  WHERE `shifts`.`opening_hour_id` = 8
SELECT `shifts`.* FROM `shifts`  WHERE `shifts`.`opening_hour_id` = 3
---
      <div class="form-group">
          <button type="button" class="btn btn-default remove_shift" <%=  'disabled' if ((shift.opening_hour.shifts.count-1) != shift_index) %>>