app/views/dishes/_form.html.erb

SELECT `categories`.* FROM `categories`   ORDER BY `categories`.`name` ASC
---
    <%= f.label :category %>
    <%= f.collection_select :category_id,
        Category.order(:name), :id, :name,
        {prompt: true, selected: @dish.category_id},
        {class: 'form-control'} %>

SELECT `ingredients`.* FROM `ingredients`   ORDER BY `ingredients`.`name` ASC
---
    <%= f.label :ingredients %>
    <%= f.collection_check_boxes :ingredient_ids, Ingredient.order(:name), :id, :name do |b|