app/views/dishes/show.html.erb

SELECT `ingredients`.* FROM `ingredients` INNER JOIN `dishes_ingredients` ON `ingredients`.`id` = `dishes_ingredients`.`ingredient_id` WHERE `dishes_ingredients`.`dish_id` = 3
---
  <dt><%= Dish.human_attribute_name 'ingredients' %></dt>
   <% @dish.ingredients.each do |ingredient| %>