app/views/prices/_list.html.erb

  <tbody>
    <% if dish.prices.size > 0 %>
---
SELECT COUNT(*) FROM `prices`  WHERE `prices`.`dish_id` = 2
SELECT COUNT(*) FROM `sizes`