app/views/prices/_price.html.erb

SELECT  `sizes`.* FROM `sizes`  WHERE `sizes`.`id` = 1 LIMIT 1
---
  <td> <%= price.id %> </td>
  <td> <%= price.size.name %> </td>