app/controllers/categories_controller.rb

SELECT `categories`.* FROM `categories`
---
  def index
    respond_to do |format|
      format.html { @categories = Category.all }

INSERT INTO `categories` (`created_at`, `name`, `updated_at`) VALUES ('2014-04-11 08:22:30', 'Vegetarian', '2014-04-11 08:22:30')
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

SELECT  `categories`.* FROM `categories`  WHERE `categories`.`id` = 4 LIMIT 1
---
    def set_categories
      @category = Category.find(params[:id])