app/controllers/dishes_controller.rb

  def index
    respond_to do |format|
      format.html { @dishes = Dish.all }
---
SELECT `dishes`.* FROM `dishes`

  def create
    @dish = Dish.new(dish_params)

    respond_to do |format|
      if @dish.save
---
INSERT INTO `dishes` (`category_id`, `created_at`, `description`, `name`, `updated_at`) VALUES (4, '2014-04-10 06:10:33', '', 'Oka', '2014-04-10 06:10:33')

  def update
    respond_to do |format|
      if @dish.update(dish_params)
---
UPDATE `dishes` SET `photo_content_type` = 'image/png', `photo_file_name` = 'vegimage.png', `photo_file_size` = 258950, `photo_updated_at` = '2014-04-14 01:37:59', `updated_at` = '2014-04-14 01:37:59' WHERE `dishes`.`id` = 1

  def destroy
    @dish.destroy
---
DELETE FROM `dishes` WHERE `dishes`.`id` = 3

    def set_dishes
      @dish = Dish.find(params[:id])
---
SELECT  `dishes`.* FROM `dishes`  WHERE `dishes`.`id` = 3 LIMIT 1