app/controllers/ingredients_controller.rb

  def index
    respond_to do |format|
      format.html { @ingredients = Ingredient.all }
---
SELECT `ingredients`.* FROM `ingredients`

  def create
    @ingredient = Ingredient.new(ingredient_params)

    respond_to do |format|
      if @ingredient.save
---
INSERT INTO `ingredients` (`created_at`, `name`, `price`, `updated_at`) VALUES ('2014-04-10 13:13:04', 'Sauce', 0.89, '2014-04-10 13:13:04')

  def update
    respond_to do |format|
      if @ingredient.update(ingredient_params)
---
UPDATE `ingredients` SET `avatar_file_name` = 'vegimage.png', `avatar_updated_at` = '2014-04-10 09:44:52', `updated_at` = '2014-04-10 09:44:52' WHERE `ingredients`.`id` = 1

    def set_ingredients
      @ingredient = Ingredient.find(params[:id])
---
SELECT  `ingredients`.* FROM `ingredients`  WHERE `ingredients`.`id` = 2 LIMIT 1