app/controllers/opening_hours_controller.rb

  def destroy_shift
    Shift.find(params[:id]).destroy
---
DELETE FROM `shifts` WHERE `shifts`.`id` = 10
SELECT  `shifts`.* FROM `shifts`  WHERE `shifts`.`id` = 10 LIMIT 1

  def create
    @opening_hour = OpeningHour.new(opening_hour_params)
    if @opening_hour.save
---
INSERT INTO `opening_hours` (`created_at`, `day_of_week`, `place_id`, `updated_at`) VALUES ('2014-04-12 11:04:30', 'Sunday', 1, '2014-04-12 11:04:30')

  def update
    @opening_hour.shifts.destroy_all
    if @opening_hour.update(opening_hour_params)
---
DELETE FROM `shifts` WHERE `shifts`.`id` = 15
UPDATE `shifts` SET `end_at` = '2000-01-01 14:00:00', `start_at` = '2000-01-01 02:00:00', `updated_at` = '2014-04-13 09:52:24' WHERE `shifts`.`id` = 1

  def destroy
    @opening_hour.destroy
---
DELETE FROM `opening_hours` WHERE `opening_hours`.`id` = 2

    def set_opening_hour
      @opening_hour = OpeningHour.find(params[:id])
---
SELECT  `opening_hours`.* FROM `opening_hours`  WHERE `opening_hours`.`id` = 3 LIMIT 1