app/controllers/places_controller.rb

  def index
    respond_to do |format|
      format.html { @places = Place.all }
---
SELECT `places`.* FROM `places`

  def create
    @place = Place.new(place_params)

    respond_to do |format|
      if @place.save
---
INSERT INTO `places` (`address`, `created_at`, `description`, `map`, `name`, `phone`, `updated_at`) VALUES ('Shop 212, Sorrento Quay, Hillarys Boat Harbour, Sorrento, WA, 6020', '2014-04-11 03:56:58', 'Take-away phone orders welcome. Bookings taken for 10 or more only.', 'https://goo.gl/maps/xA3hy', 'Hillarys', '(08) 9243 3114', '2014-04-11 03:56:58')

  def update
    respond_to do |format|
      if @place.update(place_params)
---
UPDATE `places` SET `map` = '', `updated_at` = '2014-04-11 14:01:25' WHERE `places`.`id` = 1

    def set_places
      @place = Place.find(params[:id])
---
SELECT  `places`.* FROM `places`  WHERE `places`.`id` = 1 LIMIT 1