app/controllers/prices_controller.rb

INSERT INTO `prices` (`created_at`, `dish_id`, `size_id`, `updated_at`, `value`) VALUES ('2014-04-10 03:14:48', 2, 2, '2014-04-10 03:14:48', 17.0)
---
  def create
    @price = Price.new(price_params)
    if @price.save!

UPDATE `prices` SET `updated_at` = '2014-04-10 07:09:58', `value` = 17.5 WHERE `prices`.`id` = 7
---
  def update
    if @price.update!(price_params)

DELETE FROM `prices` WHERE `prices`.`id` = 2
---
  def destroy
    @price.destroy!

SELECT  `prices`.* FROM `prices`  WHERE `prices`.`id` = 7 LIMIT 1
---
    def set_prices
      @price = Price.find(params[:id])