app/controllers/sizes_controller.rb

SELECT `sizes`.* FROM `sizes`
---
  def index
    respond_to do |format|
      format.html { @sizes = Size.all }

INSERT INTO `sizes` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2014-04-11 08:23:28', '12 slices/12 inch', 'Big Caeser', '2014-04-11 08:23:28')
---
  def create
    @size = Size.new(size_params)

    respond_to do |format|
      if @size.save

SELECT  `sizes`.* FROM `sizes`  WHERE `sizes`.`id` = 1 LIMIT 1
---
    def set_sizes
      @size = Size.find(params[:id])